cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
/*  
 * ======== Init_Clock ========
 */
void Init_Clock (void)
{
    //Initialization of clock module
    P1SEL |= BIT0;  // P1.0 as ACLK, ACLK (8Mhz)for AFE44X0
    P1DIR |= BIT0;  // output
//    P7SEL |= BIT7;  // P7.7 as MCLK, for test
//    P7DIR |= BIT7;  // output
    UCSCTL5 |= DIVPA__4; // ACLK/2 at external pin, (即 16M/2)
    UCSCTL3 = SELREF__REFOCLK;  // use REFO to source the FLL,  FLLREFDIV (n): 000-1分频
    UCSCTL4 = (UCSCTL4 & ~(SELA_7|SELM_7)) | (SELA__DCOCLK) | (SELM__DCOCLK); //DCOCLK for ACLK and MCLK
    
    Init_FLL_Settle(SYS_CLK / 1000, SYS_CLK / 32768);   //Start the FLL,  DCOCLK = 24Mhz
//   Init_FLL_Settle(USB_MCLK_FREQ / 1000, USB_MCLK_FREQ / 32768);   //set FLL (DCOCLK)
}


void Show_Wait_Symbol(void)
{
    OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Ready");
    OLED_ShowWaitSymbol(SPO2_Wait_Symbol_Start_X,SPO2_Wait_Symbol_Start_Y,1);
    OLED_ShowWaitSymbol(SPO2_Wait_Symbol_Start_X+16,SPO2_Wait_Symbol_Start_Y,1);
    OLED_ShowWaitSymbol(SPO2_Wait_Symbol_Start_X+32,SPO2_Wait_Symbol_Start_Y,1);
    OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X,HR_Wait_Symbol_Start_Y,1);
    OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X+16,HR_Wait_Symbol_Start_Y,1);
    OLED_ShowWaitSymbol(HR_Wait_Symbol_Start_X+32,HR_Wait_Symbol_Start_Y,1);
    
    // 显示电量
    HalShowBattVol(BATTERY_MEASURE_SHOW);
}
/*  
 * ======== Init_Ports ========
 */
void Init_Ports (void)
{
    //Initialization of ports (all unused pins as outputs with low-level
    P1OUT = 0xFF;
    P1DIR = 0xFF;
    P2OUT = 0xFF;
    P2DIR = 0xFF;
    P3OUT = 0x00;
    P3DIR = 0xFF;
    P4OUT = 0x00;
    P4DIR = 0xFF;
    P5OUT = 0x00;
    P5DIR = 0xFF;
    P6OUT = 0x00;
    P6DIR = 0xFF;
//    P7OUT = 0x00;
//    P7DIR = 0xFF;
//    P8OUT = 0x00;
//    P8DIR = 0xFF;
    #if defined (__MSP430F563x_F663x)
		P9OUT = 0x00;
		P9DIR = 0xFF;
    #endif
}



/*  
 * ======== Init_TimerA1 ========
 */
void Init_TimerA1 (void)
{
    TA1CCR0 = 50000;
    TA1CTL |= TASSEL_1 + MC_1 + TACLR; //ACLK--16Mhz, clear TAR
}



/*  
 * ======== TIMER1_A0_ISR ========
 */
int xxxx = 0;
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0_ISR (void)
{
  TA1CCTL0 &= ~CCIE;                  //CCR0 interrupt disable
  if(xxxx < 1)
    xxxx++;
  else
  {
    xxxx = 0;
    if(HR_update == 1)
    {
      OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,1); //大心
      OLED_Refresh_Gram();       
      HR_update = 0;
    }
    else if(!Finger_out)
    {
      OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空
      OLED_Refresh_Gram();    
    }
    
  }
  TA1CCTL0 |= CCIE;                 //CCR0 interrupt enable
  
}


// Port 2 interrupt service routine 采样频率为80Hz，也就是每1/80s进入一次中断
#pragma vector=PORT2_VECTOR  //DRDY interrupt
__interrupt void Port_2(void)
{
  
  switch (P2IV)
  {
  case P2IV_P2IFG2:   
    P2IFG &= ~BIT2;                                   // Clear P2.2 IFG i.e Data RDY interrupt status
    //P5OUT |= BIT0;                                  //Turn on LED P5.0 (Green)
    readDataFlag = 1;                                 // Set Flag to read AFE44x0 ADC REG data
    //计算SPO2和HR的值
    Cal_spo2_and_HR();                                // 每进一次中断，计算一次
    break;
    
  case P2IV_NONE:
    break;
  }
}
// Port 1 按键中断服务函数 ,P1.6
#pragma vector=PORT1_VECTOR  //DRDY interrupt
__interrupt void Port_1(void)
{
  P2IE &= ~BIT2;                        
  switch (P1IV)
  {
  case P1IV_P1IFG6:
    P1IE &= ~BIT6;               // P1.7 interrupt DISABLE
    Device_waite_time1 = 0;  //等待状态计数值清0
    Finger_out_num = 0;      //计数器状态清0
    if(Device_status == DEVICE_SLEEP)//处于睡眠态，长按短按都是进入等待态
    {
      Device_status = DEVICE_WAIT;
      LPM4_EXIT;
      OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
      Show_Wait_Symbol();
      OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
      OLED_Refresh_Gram();
    }
    else    //处于等待状态或是测量状态有按键按下
    {
      int Press_type = 0;       //0表示短按，1表示长按
      //判断是长按还是短按
      for(Press_type = 0;Press_type < 1000; Press_type++)//16Mhz下 约1.22s
      {
        if(P1IN&BIT6)    //P1.6是高电平，表示松开按键
          break;
        delay(2000);
      }
      if(Press_type != 1000)    //短按
        Press_type = 0;
      else
        Press_type = 1;         //长按
      if(Device_status == DEVICE_WAIT)//处于等待状态
      {
        if(Press_type == 0)//短按，开始测量
        {
          Device_status = DEVICE_MEASURE;
          //打开AFE4400
          AFE44xx_PowerOn();
          //打开AFE4400的中断
          Enable_AFE44xx_DRDY_Interrupt();
          //打开定时器中断
          //TA1CCTL0 |= CCIE;
          OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Go   ");
        }
        else//长按，关屏
          Device_status = DEVICE_SLEEP;
      }
      else if(Device_status == DEVICE_MEASURE)//处于测量状态
      {
        if(Press_type == 0)//短按，停止测量
        {
          Device_status = DEVICE_WAIT;
          //关闭定时器中断
         // TA1CCTL0 &= ~CCIE;
          //关闭AFE4400的中断
          Disable_AFE44xx_DRDY_Interrupt();          
          //关闭AFE4400
          AFE44xx_PowerOff();
          OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
          Show_Wait_Symbol();
          OLED_ShowHeartSymbol(Heart_Sympol_Start_X,Heart_Sympol_Start_Y,1,0); //清空心型图标
          OLED_Refresh_Gram();
        }
        else//长按，关屏
          Device_status = DEVICE_SLEEP;
      }
    }
    P1IFG &= ~BIT6;             // P1.6 IFG cleared
    P1IE |= BIT6;               // P1.7 interrupt enabled
    break;
    
  case P1IV_NONE:
    break;
  }
  P2IE |= BIT2;  
}
unsigned char ascii2uint8 (unsigned char asciiVal)
{
	unsigned char uint8Val;
	
	if (asciiVal > 0x60 && asciiVal < 0x67)			// 'a' to 'f'
		uint8Val = ((asciiVal - 0x61) + 0x0A);
  	else if (asciiVal > 0x40 && asciiVal < 0x47)		// 'A' to 'F'
  		uint8Val = ((asciiVal - 0x41) + 0x0A);
  	else if (asciiVal > 0x2F && asciiVal < 0x3A)		// '0' to '9'
  		uint8Val = (asciiVal - 0x30);
  	else												// others
  		uint8Val = 0;
  		
  	return uint8Val;
}




/*  
 * ======== init_UART  ========
 */
void Init_UART()
{
  P4SEL |= BIT4+BIT5;                        // P4.4,5 = USCI_A1 TXD/RXD
  //P4DIR |= BIT4;
  UCA1CTL1 |= UCSWRST;                       // **Put state machine in reset**
  UCA1CTL1 |= UCSSEL_1;                      // ACLK -- 16MHz
  UCA1MCTL |= UCOS16;                        // UCOS16 =1, oversampling mode
  
//  UCA1BR0 = 52;                            // 16MHz 19200 Buard rate (see User's Guide), 
//  UCA1BR1 = 0;                             // 16MHz 
//  UCA1MCTL |=  UCBRF_1;                    // Modulation UCBRSx=0, UCBRFx=1
    
  UCA1BR0 = 104;                             // 16MHz 9600 Buard rate (see User's Guide), 
  UCA1BR1 = 0; 
  
