cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
  UCA1MCTL |= UCBRS_3;
 
  UCA1CTL1 &= ~UCSWRST;                      // **Initialize USCI state machine**
}


/*  
 * ======== UART_send  ========
 */

void UART_send(unsigned char* byt_string, int length)
{
  int ii;
  for(ii=0; ii<length;ii++)
  {
    while(UCA1STAT & UCBUSY);
    UCA1TXBUF = *(byt_string+ii);
  }
}


void Cal_spo2_and_HR(void)
{
    AFE44xx_SPO2_Data_buf[0] = AFE44xx_Reg_Read(46);  //read RED - Ambient Data
    AFE44xx_SPO2_Data_buf[1] = AFE44xx_Reg_Read(47);  //read IR - Ambient Data
    if (AFE44xx_SPO2_Data_buf[0] > 2000000 ||AFE44xx_SPO2_Data_buf[1] > 2000000 )//判断Finger OUt状态
    {
      Finger_out = 1;  // finger out 标志置1，表示手指脱离指夹
    }
    else
    {
      Finger_out = 0;  // finger out 标志置零
      //滑动平均滤波滤除高频噪声 
      MAF_data_Led1_new = Moving_Average_unsig(AFE44xx_SPO2_Data_buf[0],MAF_data_Led1,MA_buf_Led1,MA_N);  // 本程序中的LED1对应datasheet的LED2。
      MAF_data_Led2_new = Moving_Average_unsig(AFE44xx_SPO2_Data_buf[1],MAF_data_Led2,MA_buf_Led2,MA_N);  //本程序中的LED2对应datasheet的LED1。
      
      //DC      
      Led1_DC_new = Moving_Average_unsig(MAF_data_Led1_new,Led1_DC,dc_led1_buf,SPO2_N);  // 对低通滤波后的数据在窗（窗长SPO2_N要大于一个PPG周期，取5~10个周期）内求平均得到DC
      Led2_DC_new = Moving_Average_unsig(MAF_data_Led2_new,Led2_DC,dc_led2_buf,SPO2_N);
      //AC      
      MAF_data_Led1_diff = MAF_data_Led1_new - MAF_data_Led1;   // 微分后取绝对值， 即为abs（AC）
      MAF_data_Led2_diff = MAF_data_Led2_new - MAF_data_Led2;   // 微分后取绝对值  
          
      Led1_AC_new = Moving_Average_float(abs(MAF_data_Led1_diff),Led1_AC,ac_led1_buf,SPO2_N);  
      Led2_AC_new = Moving_Average_float(abs(MAF_data_Led2_diff),Led2_AC,ac_led2_buf,SPO2_N);
          
      //更新数据        
      Led1_DC = Led1_DC_new;
      Led2_DC = Led2_DC_new; 
          
      Led1_AC = Led1_AC_new;
      Led2_AC = Led2_AC_new;   
      //血氧值计算        
      R1 = (float)Led1_AC/Led2_AC;   // 血氧计算
      R2 = (float)Led2_DC/Led1_DC;
          
      R = R2*R1;
      spo2_instant1 = 110-25*R;                    //瞬时血氧值 
          
      //HR calculation===================================================*/     
      /* HR 计算采用 原始数据AC峰值判别与一阶微分数据峰值判别相结合的方法，两种方法分别得到的结果若一致则认为此次峰值搜索有效 */
      /* AFE4400 输出的为光强变化信号（波形与PPG信号相反），考虑到PPG反射波影响，搜索波形峰值效果较好*/  
        
      //=====================================利用原始数据AC成分求HR================================================//          
       MAF_data_Led1 = MAF_data_Led1_new;	//更新数据(SPO2计算中有用)
       temp2 = (NRCOEFF * Led2_HR_AC_prev);
       Led2_HR_AC = (signed int)(MAF_data_Led2_new - MAF_data_Led2) + (signed int) temp2;
       MAF_data_Led2 = MAF_data_Led2_new;        
       Led2_HR_AC_prev = Led2_HR_AC;                       // 提取IR led AC成分
     
       fifo_move(Led2_HR_AC,HR_window,HR_window_L);        // 移动窗口
       window_move_count = window_move_count +1;           // 窗口移动次数计数 
          
       local_max = HR_window[0];                           // 寻找HR_window内的最大值
       for (int ii = 1; ii < HR_window_L; ii++)
       {
         if (HR_window[ii] > local_max)
         {
           local_max = HR_window[ii];                    // 窗口内数据最大值
           max_location = ii;                            // 最大值在窗口内索引
         }
       }
       if (max_location == HR_window_L/2-1 || max_location == HR_window_L/2)     // 若最大值位置在HR_window的正中间，则认为峰值搜索到。HR_window 长度为HR_window_L
       {
         if(window_move_count >= Fs/3 && window_move_count < 2*Fs)               //相邻两峰值距离判断，大于Fs/3（180BPM）小于2Fs（30BPM）则认为有效
         {
           HR_instant = (float)Fs*60/window_move_count;                         // HR 计算
          
           HR_average = Moving_Average_float(HR_instant,HR_average_prev,HR_buf,HR_BUF_L);  // 对HR_instant进行MA滤波，HR_average 为float类型       
           
           HR_raw = (int)(HR_average + 0.5);             // HR_raw 代表利用原始AC数据得到的HR
           
           HR_average_prev = HR_average;
           
           HR_update = 1;
           
         } 
         window_move_count = 0;      // 当搜到峰值时，window_move_count初始化为0，重新计数                        
       }        
       
       //================================= 利用一阶微分后数据求HR================================================//          
       if (MAF_data_Led2_diff >0)
       {
         MAF_data_Led2_diff = 0;   // 微分大于零值进行置零（因为波形为PPG取反
       }
       MAF_data_Led2_diff_abs = abs(MAF_data_Led2_diff);  //小于零的变成正数

       fifo_move(MAF_data_Led2_diff_abs,HR_diff_window,HR_diff_window_L);  // 窗口移动
       diff_window_move_count = diff_window_move_count +1;                 // 窗口移动次数计数 
          
       local_diff_max = HR_diff_window[0];                                 // 寻找HR_diff_window内的最大值及最大值索引坐标
       for (int ii = 1; ii < HR_diff_window_L; ii++)
       {
         if (HR_diff_window[ii] > local_diff_max)
         {
           local_diff_max = HR_diff_window[ii];
           max_diff_location = ii;                                        //最大值索引坐标
         }
       }
       
       if (max_diff_location == HR_diff_window_L/2-1 || max_diff_location == HR_diff_window_L/2 )     // 峰值位置是否在HR_window的正中间，若在中间，则表示检测出一个峰值，并进行下面的处理
       {
         // 连续三次搜索到的最大值均小于阈值则 重置缓存区重新计算阈值，为防止阈值太大造成的HR无法更新
         if ( local_diff_max_buf[0] < 0.7*threshold_diff_ac && local_diff_max_buf[1] < 0.7*threshold_diff_ac && local_diff_max_buf[2] < 0.7*threshold_diff_ac )
         {
           for (int jj = 0; jj<SUM_DIFF_AC_BUF_L;jj++)
           {
             sum_diff_ac_buf[jj] = 0;
           }                    
           threshold_diff_ac_sum = 0;
           threshold_diff_ac =0;
         }
         local_diff_max_buf[2] = local_diff_max_buf[1];   // 局部最大值缓存更新（连续三次的）
         local_diff_max_buf[1] =  local_diff_max_buf[0];  
         local_diff_max_buf[0] = local_diff_max; 
         
         if(diff_window_move_count >= Fs/3 && diff_window_move_count < 2*Fs && local_diff_max> 0.7*threshold_diff_ac )       //相邻两谷值距离判断，大于Fs/3且小于2Fs,并且极大值要大于阈值，则认为有效
         {
           threshold_diff_ac_sum =  sum_AC(local_diff_max,threshold_diff_ac_sum,sum_diff_ac_buf,SUM_DIFF_AC_BUF_L);   //更新阈值，为前SUM_DIFF_AC_BUF_L个有效极大值取平均
           threshold_diff_ac = threshold_diff_ac_sum/SUM_DIFF_AC_BUF_L;
              

           HR_diff_instant = (float)Fs*60/diff_window_move_count;   // 计算HR
           HR_diff_average = Moving_Average_float(HR_diff_instant,HR_diff_average_prev,HR_diff_buf,HR_BUF_L);  // 对HR_instant进行MA滤波，HR_average 为float类型

           if ((HR_diff_average-HR_diff_average_prev)<2 &&(HR_diff_average-HR_diff_average_prev)>-2 )
           {
             HR_diff = (int)(HR_diff_average + 0.5);
/////////////////////////////////////////////////////////////////////////////////             
             if(HR_diff_count < HR_BUF_L)   // 计算出有效HR_diff的次数进行计数，以作为初始检测时更新OLED屏的依据，
             {
               HR_diff_count++;
             }
             else if(HR_diff_count == HR_BUF_L)  //若HR_diff_count等于HR_BUF_L则开始更新OLED屏HR
             {
               HR_OLED_flag = 1;
             }
////////////////////////////////////////////////////////////////////////////////             
           }
           HR_diff_average_prev = HR_diff_average;
         }
         diff_window_move_count = 0;  // 当搜到峰值时，diff_window_move_count初始化为0，重新计数   
       }
    }
  return;  
}

/**********************************************************************************************************
* Init_KEY_Interrupt
* P1_6--KEY
**********************************************************************************************************/
void Init_KEY_Interrupt (void)
{
    P1DIR &= ~BIT6;
    P1REN |= BIT6;              // Enable P1.7 internal resistance
    P1OUT |= BIT6;              // Set P1.7 as pull-Up resistance
    P1IES |= BIT6;              // P1.7 Hi/Lo edge 下降延中断
    P1IFG &= ~BIT6;             // P1.7 IFG cleared
    P1IE |= BIT6;               // P1.7 interrupt enabled
}